package collection.compare.test;

 /*
  Q : 카드 게임 만들기
    : 카드는 1-13 까지 있음. 각 번호당 다음 4개의 문양이 있음. (총 52장)
    ♠ | 스페이드
    ♥ | 하트
    ♦ | 다이아
    ♣ | 클로버
    52장의 카드 뭉치를 덱(Deck) 이라 함.
    2명의 플레이어(Player) 가 게임을 진행함.

    게임은 다음 순서를 따름.
    1. 덱에 있는 카드를 랜덤하게 섞는다.
    2. 각 플레이어는 덱에서 카드를 5장씩 뽑는다.
    3. 각 플레이어는 5장의 카드를 정렬된 순서대로 보여준다. 정렬 기준은 다음과 같다.
        > 작은 순서가 먼저 나옴.
        > 같은 숫자의 경우 ♠, ♥, ♦, ♣ 순으로 정렬.
    4.카드 숫자의 함계가 큰 플레이어가 승리한다.
*/

public class CardGameMain {
    public static void main(String[] args) {

    }
}
